docs/_org/usage_print.org
Overview of 'harpwise print':

  The mode 'print' takes its arguments (holes, notes, licks, scales,
  semitones or special keywords) and prints them with additional
  information.

  Moreover it has various reports about the licks or the scales and
  intervals that are known harpwise.

  If you specify a scale (optional) too, the scale-membership of the
  the notes will be shown.

  Its argument can be any of:

    - holes (e.g. '-1')
    - notes (e.g. 'a4')
    - semitones (e.g. '+12st')
    - licks (e.g. 'st-louis')
    - lick progressions
    - scales (e.g. 'chord-i')
    - scale progressions
    - jams
    - 'l', '2l', for the last lick, 2nd-to-last, etc.

  or one of the known extra arguments (that themselves might require
  additional arguments):

    - licks-details:
  [2m    all licks currently selected (e.g. by option -t) with all details[0m
    - licks-list:
  [2m    short list of selected licks (e.g. by option -t) with hole count only[0m
    - licks-list-all:
  [2m    short list of all licks (disregarding e.g option -t); hole count only[0m
    - licks-with-tags:
  [2m    list licks (each with its tags) according to the various tag-options[0m
    - licks-tags-stats:
  [2m    statistics for all known licks and their tags[0m
    - licks-history:
  [2m    show, which licks you played recently in mode licks; the shortcuts[0m
  [2m    ('l', '2l', ...) from the output can be used as arguments to[0m
  [2m    option --start-with[0m
    - licks-starred:
  [2m    show all starred licks[0m
    - lick-progressions, lick-progs:
  [2m    print all known lick progressions. These can be narrowed by giving[0m
  [2m    option -t (this is the only case, where this option applies to[0m
  [2m    lick progressions instead of licks). Please note, that to print a[0m
  [2m    single lick-progression, you may just give its name on the[0m
  [2m    commandline without any extra-keyword[0m
    - licks-dump:
  [2m    dump all selected licks in json-format[0m
    - holes-history:
  [2m    show, which holes you played recently, from any mode[0m
    - scales:
  [2m    For all scales or the scales given as arguments: print them with[0m
  [2m    their details; with --brief only liste their names[0m
    - scale-progs, scale-progressions:
  [2m    print all known scale progressions[0m
    - intervals:
  [2m    print all known intervals[0m
    - player, players:
  [2m    print details about players matching argument or a list of all[0m
  [2m    known players[0m
    - jams:
  [2m    List available jamming-files. This is much like "harpwise jam ls",[0m
  [2m    which however has a more relaxed way of specifying the jam.[0m
  [2m    See there for details.[0m

  
Usage by Examples:

  Print lots of information for given holes or notes:

    #+begin_src 
    harpwise print +1 +2 a4 bf5
    #+end_src

  Map semitones to holes and notes (which are probably more familiar):

    #+begin_src 
    harpwise print +0st +11st -1st
    #+end_src

  Print holes and notes of a lick:

    #+begin_src 
    harpwise print st-louis
    #+end_src

  Print holes and notes of a scale (blues):

    #+begin_src 
    harpwise print blues
    #+end_src

  Print the scales, each note belongs to too:

    #+begin_src 
    harpwise print chord-i feeling-bad --add-scales chord-iv,chord-v
    #+end_src

  Print the major pentatonic scale but shift it down by 7 semitones:

    #+begin_src 
    harpwise print mape --transpose-scale -7st
    #+end_src

  nearly the same result can be achieved by

    #+begin_src 
    harpwise print mape
    #+end_src

  and then take these holes as input for tools:

    #+begin_src 
    harpwise tools shift -7st -2 -3// -3 -4 +5 +6
    #+end_src


  Print all details for favorite licks:

    #+begin_src 
    harpwise print licks-details --tags-any favorites
    #+end_src

  (if you have tagged some licks with tag favorites)

  or narrow to a lick-progression and reduce amount of output:

    #+begin_src 
    harpwise print licks-details --brief --lick-prog box1
    #+end_src


  Print a list of licks (only those selected e.g. by -t)

    #+begin_src 
    harpwise print licks-list -t fav
    #+end_src

  A longer list of all known licks:

    #+begin_src 
    harpwise print licks-list-all
    #+end_src


  A report showing licks with stats regarding tags:

    #+begin_src 
    harpwise print licks-with-tags
    #+end_src

  (which might help to find underused or duplicate tags)


  Print licks with tags 'fav' first, and then all

    #+begin_src 
    harpwise print licks-tags-stats -t fav
    #+end_src

  which is (by using defaults) the same as:
  
    #+begin_src 
    harpwise print richter licks-tags-stats -t fav
    #+end_src

  If you have collected licks for the chromatic harmonica, you may
  also use:

    #+begin_src 
    harpwise print chromatic licks-tags-stats
    #+end_src


  Show the licks you played recently along with their shortcuts 'l',
  '2l', ...
  
    #+begin_src 
    harpwise print licks-history
    #+end_src


  List all the licks, that you have starred (press '*' in mode licks,
  while it is beeing played):

    #+begin_src 
    harpwise print licks-starred
    #+end_src

  Remark: In other modes you may access these licks through the
  tag 'starred', which they get assigned automatically.


  Show all known scales:

    #+begin_src 
    harpwise print scales
    #+end_src


  Show the names of all known intervals:

    #+begin_src 
    harpwise print intervals
    #+end_src


  You may also check out mode tools for some more helpers.
  

  Harpwise comes with a short list of famous players and information
  about them; you may request this list to be printed:

    #+begin_src 
    harpwise print players
    #+end_src

  Or details for a specific player:

    #+begin_src 
    harpwie print player miller
    #+end_src

  This is the same information, that is printed line by line in mode
  listen.
