docs/_html/usage_print.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="notebook-marc" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<p>
Overview of 'harpwise print':
</p>

<p>
The mode 'print' takes its arguments (holes, notes, licks, scales,
semitones or special keywords) and prints them with additional
information.
</p>

<p>
Moreover it has various reports about the licks or the scales and
intervals that are known harpwise.
</p>

<p>
If you specify a scale (optional) too, the scale-membership of the
the notes will be shown.
</p>

<p>
Its argument can be any of:
</p>

<ul class="org-ul">
<li>holes (e.g. '-1')</li>
<li>notes (e.g. 'a4')</li>
<li>semitones (e.g. '+12st')</li>
<li>licks (e.g. 'st-louis')</li>
<li>lick progressions</li>
<li>scales (e.g. 'chord-i')</li>
<li>scale progressions</li>
<li>jams</li>
<li>'l', '2l', for the last lick, 2nd-to-last, etc.</li>
</ul>

<p>
or one of the known extra arguments (that themselves might require
additional arguments):
</p>

<ul class="org-ul">
<li>licks-details:</li>
</ul>
<p>
[2m    all licks currently selected (e.g. by option -t) with all details[0m
</p>
<ul class="org-ul">
<li>licks-list:</li>
</ul>
<p>
[2m    short list of selected licks (e.g. by option -t) with hole count only[0m
</p>
<ul class="org-ul">
<li>licks-list-all:</li>
</ul>
<p>
[2m    short list of all licks (disregarding e.g option -t); hole count only[0m
</p>
<ul class="org-ul">
<li>licks-with-tags:</li>
</ul>
<p>
[2m    list licks (each with its tags) according to the various tag-options[0m
</p>
<ul class="org-ul">
<li>licks-tags-stats:</li>
</ul>
<p>
[2m    statistics for all known licks and their tags[0m
</p>
<ul class="org-ul">
<li>licks-history:</li>
</ul>
<p>
[2m    show, which licks you played recently in mode licks; the shortcuts[0m
[2m    ('l', '2l', &#x2026;) from the output can be used as arguments to[0m
[2m    option &#x2013;start-with[0m
</p>
<ul class="org-ul">
<li>licks-starred:</li>
</ul>
<p>
[2m    show all starred licks[0m
</p>
<ul class="org-ul">
<li>lick-progressions, lick-progs:</li>
</ul>
<p>
[2m    print all known lick progressions. These can be narrowed by giving[0m
[2m    option -t (this is the only case, where this option applies to[0m
[2m    lick progressions instead of licks). Please note, that to print a[0m
[2m    single lick-progression, you may just give its name on the[0m
[2m    commandline without any extra-keyword[0m
</p>
<ul class="org-ul">
<li>licks-dump:</li>
</ul>
<p>
[2m    dump all selected licks in json-format[0m
</p>
<ul class="org-ul">
<li>holes-history:</li>
</ul>
<p>
[2m    show, which holes you played recently, from any mode[0m
</p>
<ul class="org-ul">
<li>scales:</li>
</ul>
<p>
[2m    For all scales or the scales given as arguments: print them with[0m
[2m    their details; with &#x2013;brief only liste their names[0m
</p>
<ul class="org-ul">
<li>scale-progs, scale-progressions:</li>
</ul>
<p>
[2m    print all known scale progressions[0m
</p>
<ul class="org-ul">
<li>intervals:</li>
</ul>
<p>
[2m    print all known intervals[0m
</p>
<ul class="org-ul">
<li>player, players:</li>
</ul>
<p>
[2m    print details about players matching argument or a list of all[0m
[2m    known players[0m
</p>
<ul class="org-ul">
<li>jams:</li>
</ul>
<p>
[2m    List available jamming-files. This is much like "harpwise jam ls",[0m
[2m    which however has a more relaxed way of specifying the jam.[0m
[2m    See there for details.[0m
</p>


<p>
Usage by Examples:
</p>

<p>
Print lots of information for given holes or notes:
</p>

<p>
harpwise print +1 +2 a4 bf5
</p>

<p>
Map semitones to holes and notes (which are probably more familiar):
</p>

<p>
harpwise print +0st +11st -1st
</p>

<p>
Print holes and notes of a lick:
</p>

<p>
harpwise print st-louis
</p>

<p>
Print holes and notes of a scale (blues):
</p>

<p>
harpwise print blues
</p>

<p>
Print the scales, each note belongs to too:
</p>

<p>
harpwise print chord-i feeling-bad &#x2013;add-scales chord-iv,chord-v
</p>

<p>
Print the major pentatonic scale but shift it down by 7 semitones:
</p>

<p>
harpwise print mape &#x2013;transpose-scale -7st
</p>

<p>
nearly the same result can be achieved by
</p>

<p>
harpwise print mape
</p>

<p>
and then take these holes as input for tools:
</p>

<p>
harpwise tools shift -7st -2 -3// -3 -4 +5 +6
</p>


<p>
Print all details for favorite licks:
</p>

<p>
harpwise print licks-details &#x2013;tags-any favorites
</p>

<p>
(if you have tagged some licks with tag favorites)
</p>

<p>
or narrow to a lick-progression and reduce amount of output:
</p>

<p>
harpwise print licks-details &#x2013;brief &#x2013;lick-prog box1
</p>


<p>
Print a list of licks (only those selected e.g. by -t)
</p>

<p>
harpwise print licks-list -t fav
</p>

<p>
A longer list of all known licks:
</p>

<p>
harpwise print licks-list-all
</p>


<p>
A report showing licks with stats regarding tags:
</p>

<p>
harpwise print licks-with-tags
</p>

<p>
(which might help to find underused or duplicate tags)
</p>


<p>
Print licks with tags 'fav' first, and then all
</p>

<p>
harpwise print licks-tags-stats -t fav
</p>

<p>
which is (by using defaults) the same as:
</p>

<p>
harpwise print richter licks-tags-stats -t fav
</p>

<p>
If you have collected licks for the chromatic harmonica, you may
also use:
</p>

<p>
harpwise print chromatic licks-tags-stats
</p>


<p>
Show the licks you played recently along with their shortcuts 'l',
'2l', &#x2026;
</p>

<p>
harpwise print licks-history
</p>


<p>
List all the licks, that you have starred (press '*' in mode licks,
while it is beeing played):
</p>

<p>
harpwise print licks-starred
</p>

<p>
Remark: In other modes you may access these licks through the
tag 'starred', which they get assigned automatically.
</p>


<p>
Show all known scales:
</p>

<p>
harpwise print scales
</p>


<p>
Show the names of all known intervals:
</p>

<p>
harpwise print intervals
</p>


<p>
You may also check out mode tools for some more helpers.
</p>


<p>
Harpwise comes with a short list of famous players and information
about them; you may request this list to be printed:
</p>

<p>
harpwise print players
</p>

<p>
Or details for a specific player:
</p>

<p>
harpwie print player miller
</p>

<p>
This is the same information, that is printed line by line in mode
listen.
</p>
</div>
</body>
</html>
